loadTest/after-wrk.out
Running 10s test @ http://sn.in:8080
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.81ms    4.25ms  45.69ms   79.77%
    Req/Sec    43.79      5.39    50.00     60.00%
  440 requests in 10.06s, 1.76MB read
Requests/sec:     43.73
Transfer/sec:    179.43KB

Running 10s test @ http://sn.in:8080
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   111.26ms   46.58ms 479.95ms   80.95%
    Req/Sec    91.15     17.87   130.00     66.33%
  916 requests in 10.09s, 3.66MB read
Requests/sec:     90.76
Transfer/sec:    370.97KB

Running 10s test @ http://sn.in:8080
  1 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   320.87ms   64.59ms 596.24ms   72.82%
    Req/Sec    91.63     22.84   150.00     73.47%
  916 requests in 10.04s, 3.66MB read
Requests/sec:     91.22
Transfer/sec:    373.52KB

Running 10s test @ http://sn.in:8080
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   623.46ms  183.21ms   1.39s    87.67%
    Req/Sec    82.08     21.63   121.00     64.13%
  786 requests in 10.10s, 3.15MB read
Requests/sec:     77.82
Transfer/sec:    318.96KB

Running 10s test @ http://sn.in:8080
  1 threads and 80 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   925.79ms  201.20ms   1.31s    83.17%
    Req/Sec    82.32     19.83   131.00     68.04%
  820 requests in 10.07s, 3.28MB read
Requests/sec:     81.43
Transfer/sec:    333.09KB

Running 10s test @ http://sn.in:8080
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03s   196.30ms   1.37s    90.46%
    Req/Sec    92.22     18.60   141.00     71.13%
  922 requests in 10.07s, 3.69MB read
Requests/sec:     91.60
Transfer/sec:    375.74KB